Revit 2027 API
ParameterTypeId.ReferenceBaseOnHost Property
 "Reference Base on Host"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ReferenceBaseOnHost { get; }
Public Shared ReadOnly Property ReferenceBaseOnHost As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ReferenceBaseOnHost {
	ForgeTypeId^ get ();
}
static member ReferenceBaseOnHost : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace